08061108/XiOUS/CubeMX_Config/Inc/stm32f4xx_hal_conf.h
/**
  ******************************************************************************
  * @file    stm32f4xx_hal_conf_template.h
  * @author  MCD Application Team
  * @brief   HAL configuration template file.
  *          This file should be copied to the application folder and renamed
  *          to stm32f4xx_hal_conf.h.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F4xx_HAL_CONF_H
#define __STM32F4xx_HAL_CONF_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

/* ########################## Module Selection ############################## */
/**
  * @brief This is the list of modules to be used in the HAL driver
  */
#define HAL_MODULE_ENABLED          /* 用于选择要在HAL驱动中使用的模块----------------------JR*/


  /* #define HAL_ADC_MODULE_ENABLED   */
/* #define HAL_CRYP_MODULE_ENABLED   */
#define HAL_CAN_MODULE_ENABLED          /* 表示启用CAN（Controller Area Network）模块-------------------JR*/


/* #define HAL_CRC_MODULE_ENABLED   */
/* #define HAL_CRYP_MODULE_ENABLED   */
/* #define HAL_DAC_MODULE_ENABLED   */
/* #define HAL_DCMI_MODULE_ENABLED   */
/* #define HAL_DMA2D_MODULE_ENABLED   */
/* #define HAL_ETH_MODULE_ENABLED   */
/* #define HAL_NAND_MODULE_ENABLED   */
/* #define HAL_NOR_MODULE_ENABLED   */
/* #define HAL_PCCARD_MODULE_ENABLED   */
#define HAL_SRAM_MODULE_ENABLED           /* 启用SRAM（静态随机存取存储器）模块-------------------JR*/

/* #define HAL_SDRAM_MODULE_ENABLED   */
/* #define HAL_HASH_MODULE_ENABLED   */

#define HAL_I2C_MODULE_ENABLED        /* 启用I2C（Inter - Integrated Circuit）模块 与I2C通信（如I2C设备驱动、I2C数据传输等）有关的代码将被包含进来----JR*/
/* #define HAL_I2S_MODULE_ENABLED   */

#define HAL_IWDG_MODULE_ENABLED       /* 启用独立看门狗（IWDG）模块 独立看门狗是一种定时器，用于监控系统的运行状态----------------JR*/

/* #define HAL_LTDC_MODULE_ENABLED   */
/* #define HAL_RNG_MODULE_ENABLED   */
#define HAL_RTC_MODULE_ENABLED        /* 启用实时时钟（RTC）模块 RTC可以提供准确的时间和日期信息-------JR*/

/* #define HAL_SAI_MODULE_ENABLED   */
#define HAL_SD_MODULE_ENABLED         /* 启用SD（Secure Digital）卡模块相关的功能，包括SD卡的初始化、数据读写等操作-------JR*/

/* #define HAL_MMC_MODULE_ENABLED   */
#define HAL_SPI_MODULE_ENABLED       /* 启用SPI（Serial Peripheral Interface）模块 SPI是一种高速、全双工的通信接口，常用于连接微控制器和外设，如传感器、存储器等--JR*/

#define HAL_TIM_MODULE_ENABLED       /* 启用定时器（TIM）模块--------JR*/

#define HAL_UART_MODULE_ENABLED      /* 启用UART（Universal Asynchronous Receiver - Transmitter）模块 UART是一种异步串行通信接口，常用于与其他设备进行数据传输--JR*/

/* #define HAL_USART_MODULE_ENABLED   */
/* #define HAL_IRDA_MODULE_ENABLED   */
/* #define HAL_SMARTCARD_MODULE_ENABLED   */
/* #define HAL_SMBUS_MODULE_ENABLED   */
/* #define HAL_WWDG_MODULE_ENABLED   */
/* #define HAL_PCD_MODULE_ENABLED   */
/* #define HAL_HCD_MODULE_ENABLED   */
/* #define HAL_DSI_MODULE_ENABLED   */
/* #define HAL_QSPI_MODULE_ENABLED   */
/* #define HAL_QSPI_MODULE_ENABLED   */
/* #define HAL_CEC_MODULE_ENABLED   */
/* #define HAL_FMPI2C_MODULE_ENABLED   */
/* #define HAL_SPDIFRX_MODULE_ENABLED   */
/* #define HAL_DFSDM_MODULE_ENABLED   */
/* #define HAL_LPTIM_MODULE_ENABLED   */

#define HAL_GPIO_MODULE_ENABLED       /* 启用通用输入输出（GPIO）模块------JR*/

#define HAL_EXTI_MODULE_ENABLED      /* 启用外部中断/事件控制器（EXTI）模块 处理来自外部设备（如按键、传感器等）的中断请求------JR*/

#define HAL_DMA_MODULE_ENABLED       /* 启用直接内存访问（DMA）模块 DMA允许外设和内存之间直接进行数据传输-----JR*/

#define HAL_RCC_MODULE_ENABLED       /* 启用实时时钟控制器（RCC）模块---------JR*/

#define HAL_FLASH_MODULE_ENABLED     /* 启用闪存（FLASH）模块 闪存可用于存储程序代码、数据等--------JR*/

#define HAL_PWR_MODULE_ENABLED       /* 启用电源（PWR）模块 该模块与微控制器的电源管理相关，例如控制不同电源模式的切换--------JR*/

#define HAL_CORTEX_MODULE_ENABLED    /* 启用Cortex - M系列内核相关模块------JR*/


/* ########################## HSE/HSI Values adaptation ##################### */
/**
  * @brief Adjust the value of External High Speed oscillator (HSE) used in your application.
  *        This value is used by the RCC HAL module to compute the system frequency
  *        (when HSE is used as system clock source, directly or through the PLL).
  */

/*--JR
HSE（外部高速振荡器）
  如果没有预先定义HSE_VALUE 则将其定义为8MHz
    这个值用于RCC（实时时钟控制器）HAL模块计算系统频率，当HSE作为系统时钟源（直接或通过PLL）时使用
*/
#if !defined  (HSE_VALUE)
  #define HSE_VALUE    ((uint32_t)8000000U) /*!< Value of the External oscillator in Hz */
#endif /* HSE_VALUE */

/* 设置HSE启动超时时间为100ms，在启动HSE时，如果在100ms内没有成功启动则会触发相应错误处理-----JR*/
#if !defined  (HSE_STARTUP_TIMEOUT)
  #define HSE_STARTUP_TIMEOUT    ((uint32_t)100U)   /*!< Time out for HSE start up, in ms */
#endif /* HSE_STARTUP_TIMEOUT */


/**
  * @brief Internal High Speed oscillator (HSI) value.
  *        This value is used by the RCC HAL module to compute the system frequency
  *        (when HSI is used as system clock source, directly or through the PLL).
  */

/*--JR
HSI（内部高速振荡器
  默认的HSI值为16MHz，用于类似HSE的计算系统频率的情况（当HSI作为时钟源时）
*/
#if !defined  (HSI_VALUE)
  #define HSI_VALUE    ((uint32_t)16000000U) /*!< Value of the Internal oscillator in Hz*/
#endif /* HSI_VALUE */

/**
  * @brief Internal Low Speed oscillator (LSI) value.
  */
/*--JR
LSI（内部低速振荡器）
  定义LSI的典型值为32kHz
*/
#if !defined  (LSI_VALUE)
 #define LSI_VALUE  ((uint32_t)32000U)       /*!< LSI Typical Value in Hz*/
#endif /* LSI_VALUE */                      /*!< Value of the Internal Low Speed oscillator in Hz
                                             The real value may vary depending on the variations
                                             in voltage and temperature.*/


/**
  * @brief External Low Speed oscillator (LSE) value.
  */
/* LSE（外部低速振荡器）将LSE的值定义为32768Hz--------JR*/
#if !defined  (LSE_VALUE)
 #define LSE_VALUE  ((uint32_t)32768U)    /*!< Value of the External Low Speed oscillator in Hz */
#endif /* LSE_VALUE */

