08061108/XiOUS/CubeMX_Config/Inc/stm32f4xx_hal_conf.h
/* LSE启动超时时间设为5000ms--------------JR*/
#if !defined  (LSE_STARTUP_TIMEOUT)
  #define LSE_STARTUP_TIMEOUT    ((uint32_t)5000U)   /*!< Time out for LSE start up, in ms */
#endif /* LSE_STARTUP_TIMEOUT */


/**
  * @brief External clock source for I2S peripheral
  *        This value is used by the I2S HAL module to compute the I2S clock source
  *        frequency, this source is inserted directly through I2S_CKIN pad.
  */
/* 用于I2S HAL模块计算I2S时钟源频率的外部时钟源值----------JR*/
#if !defined  (EXTERNAL_CLOCK_VALUE)
  #define EXTERNAL_CLOCK_VALUE    ((uint32_t)12288000U) /*!< Value of the External audio frequency in Hz*/
#endif /* EXTERNAL_CLOCK_VALUE */


/* Tip: To avoid modifying this file each time you need to use different HSE,
   ===  you can define the HSE value in your toolchain compiler preprocessor. */

/* ########################### System Configuration ######################### */
/**
  * @brief This is the HAL system configuration section
  */
/*--JR
定义VDD（电源电压）的值为3300mV
设置滴答中断的优先级为0
USE_RTOS                     0U--表示不使用实时操作系统（如果设为1则表示使用）
PREFETCH_ENABLE              1U--启用预取功能
INSTRUCTION_CACHE_ENABLE     1U--允许指令缓存
DATA_CACHE_ENABLE            1U--允许数据缓存
*/
#define  VDD_VALUE		      ((uint32_t)3300U) /*!< Value of VDD in mv */
#define  TICK_INT_PRIORITY            ((uint32_t)0U)   /*!< tick interrupt priority */
#define  USE_RTOS                     0U
#define  PREFETCH_ENABLE              1U
#define  INSTRUCTION_CACHE_ENABLE     1U
#define  DATA_CACHE_ENABLE            1U


/* ########################## Assert Selection ############################## */
/**
  * @brief Uncomment the line below to expanse the "assert_param" macro in the
  *        HAL drivers code
  */
/* #define USE_FULL_ASSERT    1U */

/* ################## Ethernet peripheral configuration ##################### */

/* Section 1 : Ethernet peripheral configuration */

/* MAC地址定义--定义了以太网的MAC地址各个字节，MAC_ADDR0到MAC_ADDR5-----JR*/
/* MAC ADDRESS: MAC_ADDR0:MAC_ADDR1:MAC_ADDR2:MAC_ADDR3:MAC_ADDR4:MAC_ADDR5 */
#define MAC_ADDR0   2U
#define MAC_ADDR1   0U
#define MAC_ADDR2   0U
#define MAC_ADDR3   0U
#define MAC_ADDR4   0U
#define MAC_ADDR5   0U

/* --JR 缓冲区相关
  ETH_RX_BUF_SIZE和ETH_TX_BUF_SIZE被定义为ETH_MAX_PACKET_SIZE--表示接收和发送缓冲区的大小
  ETH_RXBUFNB和ETH_TXBUFNB--分别定义了接收和发送缓冲区的数量为4个
*/
/* Definition of the Ethernet driver buffers size and count */
#define ETH_RX_BUF_SIZE                ETH_MAX_PACKET_SIZE /* buffer size for receive               */
#define ETH_TX_BUF_SIZE                ETH_MAX_PACKET_SIZE /* buffer size for transmit              */
#define ETH_RXBUFNB                    ((uint32_t)4U)       /* 4 Rx buffers of size ETH_RX_BUF_SIZE  */
#define ETH_TXBUFNB                    ((uint32_t)4U)       /* 4 Tx buffers of size ETH_TX_BUF_SIZE  */

/* Section 2: PHY configuration section */

/*--JR
PHY（物理层）配置
  地址相关--设为0x01U，是以太网PHY芯片的地址
  延迟相关--PHY_RESET_DELAY和PHY_CONFIG_DELAY分别定义了PHY复位延迟和配置延迟的值
  读写超时相关--PHY_READ_TO和PHY_WRITE_TO定义了PHY读写操作的超时时间
*/
/* DP83848_PHY_ADDRESS Address*/
#define DP83848_PHY_ADDRESS           0x01U
/* PHY Reset delay these values are based on a 1 ms Systick interrupt*/
#define PHY_RESET_DELAY                 ((uint32_t)0x000000FFU)
/* PHY Configuration delay */
#define PHY_CONFIG_DELAY                ((uint32_t)0x00000FFFU)

#define PHY_READ_TO                     ((uint32_t)0x0000FFFFU)
#define PHY_WRITE_TO                    ((uint32_t)0x0000FFFFU)


/* Section 3: Common PHY Registers */
/* 基本控制与状态寄存器相关--JR*/
/* 基本控制寄存器--JR*/
#define PHY_BCR                         ((uint16_t)0x0000U)    /*!< Transceiver Basic Control Register   */
/* 基本状态寄存器--JR*/
#define PHY_BSR                         ((uint16_t)0x0001U)    /*!< Transceiver Basic Status Register    */


/* 功能操作相关宏定义--JR*/
/* 复位操作--JR*/
#define PHY_RESET                       ((uint16_t)0x8000U)  /*!< PHY Reset */

/* 环回模式选择--JR*/
#define PHY_LOOPBACK                    ((uint16_t)0x4000U)  /*!< Select loop-back mode */

/* 设置PHY为100Mbps全双工模式 这个值写入BCR寄存器后，PHY会按照100Mbps的速度并且全双工的方式运行--JR*/
#define PHY_FULLDUPLEX_100M             ((uint16_t)0x2100U)  /*!< Set the full-duplex mode at 100 Mb/s */

/* 100Mbps半双工模式--JR*/
#define PHY_HALFDUPLEX_100M             ((uint16_t)0x2000U)  /*!< Set the half-duplex mode at 100 Mb/s */

/* 10Mbps全双工模式--JR*/
#define PHY_FULLDUPLEX_10M              ((uint16_t)0x0100U)  /*!< Set the full-duplex mode at 10 Mb/s  */

/* 10Mbps半双工模式--JR*/
#define PHY_HALFDUPLEX_10M              ((uint16_t)0x0000U)  /*!< Set the half-duplex mode at 10 Mb/s  */

/* 当写入BCR寄存器时启用自动协商功能。这使得PHY能够与连接的对端设备自动协商最佳的通信模式，包括速率、双工模式等--JR*/
#define PHY_AUTONEGOTIATION             ((uint16_t)0x1000U)  /*!< Enable auto-negotiation function     */

/* 用于重新启动自动协商过程--JR*/
#define PHY_RESTART_AUTONEGOTIATION     ((uint16_t)0x0200U)  /*!< Restart auto-negotiation function    */

/* 选择PHY进入电源关闭模式，降低功耗--JR*/
#define PHY_POWERDOWN                   ((uint16_t)0x0800U)  /*!< Select the power down mode           */

/* 将PHY从MII（Media Independent Interface）隔离，防止PHY与其他部分的交互--JR*/
#define PHY_ISOLATE                     ((uint16_t)0x0400U)  /*!< Isolate PHY from MII                 */


/* 状态标志相关*/
/* 当这个标志被置位时，表示自动协商过程已经完成--JR*/
#define PHY_AUTONEGO_COMPLETE           ((uint16_t)0x0020U)  /*!< Auto-Negotiation process completed   */

/* 如果这个标志被置位，说明已经建立了有效的链路连接--JR*/
#define PHY_LINKED_STATUS               ((uint16_t)0x0004U)  /*!< Valid link established               */

/* 当检测到Jabber条件（发送方发送数据过快导致接收方无法处理）时，这个标志会被置位--JR*/
#define PHY_JABBER_DETECTION            ((uint16_t)0x0002U)  /*!< Jabber condition detected            */


/* Section 4: Extended PHY Registers */
/* 扩展PHY寄存器相关--JR*/
/* 它是PHY status register Offset（PHY状态寄存器偏移量），用于定位扩展PHY状态寄存器--JR*/
#define PHY_SR                          ((uint16_t)0x10U)    /*!< PHY status register Offset                      */

/* 是一个掩码，用于从PHY状态寄存器中提取速度相关的状态信息--JR*/
#define PHY_SPEED_STATUS                ((uint16_t)0x0002U)  /*!< PHY Speed mask                                  */

/* 用于提取双工模式相关的状态信息的掩码--JR*/
#define PHY_DUPLEX_STATUS               ((uint16_t)0x0004U)  /*!< PHY Duplex mask                                 */


/* ################## SPI peripheral configuration ########################## */

/* CRC FEATURE: Use to activate CRC feature inside HAL SPI Driver
* Activated: CRC code is present inside driver
* Deactivated: CRC code cleaned from driver
*/

/* 预处理器指令部分--JR*/
/* 一个预定义宏，将USE_SPI_CRC设置为0。可能表示在SPI（串行外围接口）通信中不使用CRC（循环冗余校验）--JR*/
#define USE_SPI_CRC                     0U

/* Includes ------------------------------------------------------------------*/
/**
  * @brief Include module's header file
  */

#ifdef HAL_RCC_MODULE_ENABLED
  #include "stm32f4xx_hal_rcc.h"
#endif /* HAL_RCC_MODULE_ENABLED */

